// ◇
// fds: fdx68 selector
// DirStack: ディレクトリスタック
// Copyright: (C)2020 Hiroaki GOTO as GORRY.
// License: see readme.txt
// =====================================================================

#include "DirStack.h"

// =====================================================================
// ディレクトリスタック
// =====================================================================

// -------------------------------------------------------------
// スタックへプッシュ
// -------------------------------------------------------------
int
DirStack::push(const DirStack::Stack& stack)
{
	mDirStack.push_back(stack);
	return mDirStack.size();
}

// -------------------------------------------------------------
// スタックからポップ
// -------------------------------------------------------------
DirStack::Stack
DirStack::pop()
{
	Stack stack = mDirStack.back();
	mDirStack.pop_back();
	return stack;
}

// =====================================================================
// [EOF]
